Tekla Open API Reference for Tekla Structures 2025
Detail.PositionType Property
 The position type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PositionTypeEnum PositionType { get; set; }
Public Property PositionType As PositionTypeEnum
	Get
	Set
Property Value
Type: PositionTypeEnum
See Also
Reference
Detail Class
Tekla.Structures.Model Namespace